
;;; 考虑 (mid, with)方式进行处理, with>=0 mid > width > 0
;;; (m1, w1) * (m2, w2) 
;;; l1l2: m1m2 - m1w2 - w1m2 + w1w2
;;; u1u2: m1m2 + m1w2 + w1m2 + w1w2
;;; mm12 = m1m2 + w1w2, ww12 = m1w2 + w1m2
;;; 加法 am12 = m1 + m2, aw12 = w1 + w2
;;; 减法 sm12 = m1 - m2, sw12 = w1 + w2
;;; 除法操作与乘以(m/(m^2 - w^2), w/(m^2 - w^2))一致, 除数跨0的情况不考虑。则 |m| > |w|
;;; dm12 = m1m2/(m2^2 - w2^2) + w1w2/(m2^2 - w2^2)
;;; dw12 = m1w2/(m2^2 - w2^2) + w1m2/(m2^2 - w2^2)

;;; 在区间运算中
;;; 加减不是严格的逆运算
;;; r1 - r2 + r2 并不等于 r1
;;; 换句话说 在一个复杂的系统先降低再升高某个物理量，会因为两次操作而导致误差增大而不是减少
;;; 这貌似也符合实际情况。
;;; 乘除也有类似的效果
;;; 设计出一个没有缺陷的算术包，需要制定一些列的化简规则。来确定相同与不同的
;;; 超出了我的能力。
;;;
