(define (A x y)
  (cond ((= y 0) 0)
        ((= x 0) (* 2 y))
        ((= y 1) 2)
        (else
         (A (- x 1) (A x (- y 1)))
         ))
  )
(A 0 20)
(A 1 10)
(A 0 (A 1 9))
(A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 1 1))))))))))
(A 2 4)
(A 1 (A 1 (A 1 (A 2 1)))) 2^(2^(2^2)) = 2^(4^2)
(A 3 3)
(A 2 (A 2 (A 3 1)))
(A 4 3)
(A 3 (A 3 (A 4 1)))

(define (f n) (A 0 n)) ;; f(n)=2n
(define (g n) (A 1 n)) ;; g(n)= n=0时0, n>0时 2^n
(define (h n) (A 2 n)) ;; h(n)= n=0时0, n=1时 2, n>1时 2^2^…共(n-1次)
